use LikeBusLogisticDatabase;
go

merge dbo.[Role] as trg
using
(
  select r.Name
  from
  (
    values ('Administrator')
         , ('Moderator')
         , ('Operator')
  ) as r(Name)
) as src
on trg.Name = src.Name
  when not matched then
    insert (Name)
    values (src.Name)
  ;
go

merge dbo.[User] as trg
using
(
  select u.FirstName
       , u.Phone
  from
  (
    values ('Administrator', '+380949466705')
  ) as u(FirstName, Phone)
) as src
on trg.FirstName = src.FirstName and trg.Phone = src.Phone
  when not matched then
    insert (FirstName, Phone)
    values (src.FirstName, src.Phone)
  ;
go

merge dbo.Account as trg
using
(
  select r.Id as RoleId
       , u.Id as UserId
       , a.Login as Login
       , dbo.MD5HashPassword(a.Password) as Password
  from
  (
    values ('admin', 'p@ssw0rd321')
  ) as a(Login, Password)
  cross apply
  (
    select Id from [Role] where Name = 'Administrator'
  ) as r
  cross apply
  (
    select top 1 Id from [User] where FirstName = N'Administrator' and Phone = '+380949466705'
  ) as u
) as src
on trg.Login = src.Login
  when not matched then
    insert (RoleId, UserId, Login, Password)
    values (src.RoleId, src.UserId, src.Login, src.Password)
  ;
go

create table #driverInfo
(
  FirstName	 nvarchar (200),
  LastName	 nvarchar (200),
  MiddleName nvarchar (200),
  Contact    nvarchar (100)
);
go

insert into #driverInfo
select s.*
    from
    ( 
      values (N'Иван'   , N'Иваненко'  , N'Иванович'  , N'+380991234567')
           , (N'Степан' , N'Степаненко', N'Степанович', N'+380992345678')
           , (N'Василий', N'Василенко' , N'Васильевич', N'+380993456789')
           , (N'Дмитрий', N'Дмитренко' , N'Дмитриевич', N'+380994567890')
           , (N'Николай', N'Николенко' , N'Николаевич', N'+380995678901')
           , (N'Максим' , N'Максименко', N'Максимович', N'+380996789012')
           , (N'Юрий'   , N'Юренко'    , N'Юриевич'   , N'+380997890123')
    ) as s(FirstName, LastName, MiddleName, Contact)
;
go

merge into Driver as trg
using
(
  select di.FirstName
       , di.LastName
       , di.MiddleName
    from #driverInfo di
) src
on src.FirstName = trg.FirstName and src.LastName = trg.LastName and src.MiddleName = trg.MiddleName
  when not matched then
    insert(FirstName, LastName, MiddleName)
    values(src.FirstName, src.LastName, src.MiddleName)
    ;
go

merge into DriverContact as trg
using
(
  select di.Contact,
         d.Id as DriverId
    from #driverInfo di
    join Driver d 
      on di.FirstName = d.FirstName 
      and di.LastName = d.LastName 
      and di.MiddleName = d.MiddleName
) src
on src.DriverId = trg.DriverId and src.Contact = trg.Contact
  when not matched then
    insert(DriverId, Contact)
    values(src.DriverId, src.Contact)
    ;
go

create table #busInfo
(
  Producer	        nvarchar(200),
  Model	            nvarchar(200),
  PassengerCapacity int          ,
  Description       nvarchar(100),
  Number            nvarchar(8)  ,
  CrewCapacity      int
);
go

insert into #busInfo
select s.*
    from
    ( 
      values (N'Hyundai'      , N'H350'            , 14, N'', N'ВН1234ОО', 2)
           , (N'MAN'          , N'Lion’s Intercity', 32, N'', N'ВН5432СЕ', 2)
           , (N'Mercedes-Benz', N'Sprinter II'     , 16, N'', N'ВН5674КК', 2)
           , (N'Mercedes-Benz', N'Classic'         , 12, N'', N'ВН8683ЛИ', 2)
           , (N'MAN'          , N'Lion’s Coach'    , 44, N'', N'ВН0959ДА', 2)
           , (N'Hyundai'      , N'H350'            , 14, N'', N'ВН8567ОО', 2)
           , (N'MAN'          , N'Lion’s Intercity', 32, N'', N'ВН9393СЕ', 2)
           , (N'Mercedes-Benz', N'Sprinter II'     , 16, N'', N'ВН1238КК', 2)
           , (N'Mercedes-Benz', N'Classic'         , 12, N'', N'ВН1200ЛИ', 2)
           , (N'MAN'          , N'Lion’s Coach'    , 44, N'', N'ВН0321ДА', 2)
           , (N'Hyundai'      , N'H350'            , 14, N'', N'ВН3543ОО', 2)
           , (N'MAN'          , N'Lion’s Intercity', 32, N'', N'ВН4334СЕ', 2)
           , (N'Mercedes-Benz', N'Sprinter II'     , 16, N'', N'ВН0324КК', 2)
           , (N'Mercedes-Benz', N'Classic'         , 12, N'', N'ВН8653ЛИ', 2)
    ) as s(Producer, Model, PassengerCapacity, Description, Number, CrewCapacity)
;
go

merge into Vehicle as trg
using
(
  select distinct bi.Producer
                , bi.Model
                , bi.PassengerCapacity
                , bi.Description
    from #busInfo bi
) src
on trg.Producer = src.Producer and trg.Model = src.Model
  when not matched then
    insert(Producer, Model, PassengerCapacity, Description)
    values(src.Producer, src.Model, src.PassengerCapacity, src.Description)
    ;
go

merge into Bus as trg
using
(
  select v.Id as VehicleId
       , bi.Number
       , bi.CrewCapacity
    from #busInfo bi
    join Vehicle v
      on bi.Producer = v.Producer and bi.Model = v.Model
) src
on trg.Number = src.Number
  when not matched then
    insert(VehicleId, Number, CrewCapacity)
    values(src.VehicleId, src.Number, src.CrewCapacity)
    ;
go

drop table #busInfo;
go

drop table #driverInfo;
go

declare @BusCount int; 
select @BusCount = count(1) from Bus;
declare @DriverCount int; 
select @DriverCount = count(1) from Driver;

merge into BusDriver as trg
using
(
  select b.Id as BusId
       , d.Id as DriverId
    from Bus b
    cross join Driver d
      where b.Id % @BusCount = d.Id % @DriverCount
) src
on trg.BusId = src.BusId and trg.DriverId = src.DriverId
  when not matched then
    insert(BusId, DriverId)
    values(src.BusId, src.DriverId)
    ;
go

create table #locationInfo
(
  City nvarchar(100),
  District nvarchar(100),
  Country nvarchar(100),
  ShortCountryName char(2),
  Latitude float,
  Longitude float
);
go    
      
insert into #locationInfo
select rtrim(ltrim(s.City)) as City
     , null as District
     , rtrim(ltrim(s.Country)) as County
     , s.ShortCountryName as ShortCountryName
     , s.Latitude as Latitude
     , s.Longitude as Longitude
  from
  (
    values  ('LV', N'Латвия', N'Рига      ', 57.143620, 24.099277)
          , ('LV', N'Латвия', N'Даугавпилс', 55.960565, 26.531722)
          , ('LV', N'Латвия', N'Юрмала    ', 57.132767, 23.632446)
          , ('LV', N'Латвия', N'Вентспилс ', 57.394176, 21.556030)
          , ('LV', N'Латвия', N'Лиепая    ', 56.525670, 20.995727)
          , ('LV', N'Латвия', N'Елгава    ', 56.652709, 23.720336)
                   
          , ('LT', N'Литва', N'Вильнюс ', 54.689186, 25.269408)
          , ('LT', N'Литва', N'Клайпеда', 55.711129, 21.116576)
          , ('LT', N'Литва', N'Каунас  ', 54.904519, 23.896117)
          , ('LT', N'Литва', N'Алитус  ', 54.402418, 24.027953)
                   
          , ('BY', N'Беларусь', N'Минск  ', 53.926452, 27.543578)
          , ('BY', N'Беларусь', N'Гомель ', 52.465498, 30.949340)
          , ('BY', N'Беларусь', N'Жлобин ', 52.905042, 29.960571)
          , ('BY', N'Беларусь', N'Витебск', 55.200301, 30.158324)
          , ('BY', N'Беларусь', N'Брест  ', 52.116069, 23.764281)
                   
          , ('CZ', N'Чехия', N'Прага       ', 50.068723, 14.406474)
          , ('CZ', N'Чехия', N'Брно        ', 49.200676, 16.592753)
          , ('CZ', N'Чехия', N'Острава     ', 49.824819, 18.246196)
          , ('CZ', N'Чехия', N'Карловы Вары', 50.241180, 12.862895)
          , ('CZ', N'Чехия', N'Пардубице   ', 50.042271, 15.771525)
                   
          , ('DE', N'Германия', N'Мюнхен     ', 48.131858, 11.517697)
          , ('DE', N'Германия', N'Нюрнберг   ', 49.477622, 11.034298)
          , ('DE', N'Германия', N'Штутгарт   ', 48.802019, 9.144650 )
          , ('DE', N'Германия', N'Франкфурт  ', 50.158112, 8.683224 )
          , ('DE', N'Германия', N'Кельн      ', 50.939950, 6.947384 )
          , ('DE', N'Германия', N'Дюссельдорф', 51.257312, 6.749630 )
          , ('DE', N'Германия', N'Лейпциг    ', 51.339744, 12.330685)
                   
          , ('PO', N'Польша', N'Варшава', 52.230023, 21.020870)
          , ('PO', N'Польша', N'Краков ', 50.066522, 19.944210)
          , ('PO', N'Польша', N'Люблин ', 51.264187, 22.580929)
          , ('PO', N'Польша', N'Гданьск', 54.357071, 18.625851)
                   
          , ('HU', N'Венгрия', N'Будапешт', 47.512233, 19.032345)
                   
          , ('AT', N'Австрия', N'Вена     ', 48.212452, 16.340695)
          , ('AT', N'Австрия', N'Грац     ', 47.080077, 15.428829)
          , ('AT', N'Австрия', N'Зальцбург', 47.808215, 13.044796)
                   
          , ('NL', N'Нидерланды', N'Амстердам', 52.377816, 4.881954)
          , ('NL', N'Нидерланды', N'Роттердам', 51.946503, 4.475460)
                   
          , ('BE', N'Бельгия', N'Брюссель ', 50.849865, 4.343624)
          , ('BE', N'Бельгия', N'Антверпен', 51.222921, 4.376583)
          , ('BE', N'Бельгия', N'Гент     ', 51.064394, 3.684445)
          , ('BE', N'Бельгия', N'Шарлеруа ', 50.407331, 4.437008)
                   
          , ('CH', N'Швейцария', N'Цюрих ', 47.365705, 8.522735)
          , ('CH', N'Швейцария', N'Берн  ', 46.958599, 7.429596)
          , ('CH', N'Швейцария', N'Люцерн', 47.063474, 8.270050)
          , ('CH', N'Швейцария', N'Женева', 46.211099, 6.138702)
                   
          , ('FR', N'Франция', N'Париж   ', 48.855007, 2.317929 )
          , ('FR', N'Франция', N'Лион    ', 45.772557, 4.800839 )
          , ('FR', N'Франция', N'Нант    ', 47.231930, -1.571231)
          , ('FR', N'Франция', N'Руан    ', 49.451392, 1.076474 )
          , ('FR', N'Франция', N'Бурж    ', 47.082518, 2.372861 )
          , ('FR', N'Франция', N'Тулуза  ', 43.601532, 1.417050 )
          , ('FR', N'Франция', N'Гренобль', 45.187123, 5.679745 )
          , ('FR', N'Франция', N'Марсель ', 43.330427, 5.328183 )
          , ('FR', N'Франция', N'Монпелье', 43.633347, 3.856015 )
                   
          , ('ES', N'Испания', N'Барселона', 41.388420, 2.173207 )
          , ('ES', N'Испания', N'Мадрид   ', 40.433641, -3.734691)
          , ('ES', N'Испания', N'Валенсия ', 39.465109, -0.394847)
          , ('ES', N'Испания', N'Севилья  ', 37.410464, -6.045607)
          , ('ES', N'Испания', N'Сарагоса ', 41.668059, -0.922191)
          , ('ES', N'Испания', N'Мурсия   ', 38.008357, -1.152904)
          , ('ES', N'Испания', N'Малага   ', 36.744322, -4.485548)
          , ('ES', N'Испания', N'Бильбао  ', 43.266148, -2.947462)
          , ('ES', N'Испания', N'Аликанте ', 38.359902, -0.497511)
          , ('ES', N'Испания', N'Бенидорм ', 38.553472, -0.129469)
          , ('ES', N'Испания', N'Таррагона', 41.113443, 1.232835 )
          , ('ES', N'Испания', N'Альмерия ', 36.841099, -2.486037)
          , ('ES', N'Испания', N'Марбелья ', 36.515090, -4.886549)
                   
          , ('PT', N'Португалия', N'Лиссабон', 38.725650, -9.150795)
          , ('PT', N'Португалия', N'Порту   ', 41.163619, -8.650917)
          , ('PT', N'Португалия', N'Коимбра ', 40.230745, -8.420204)
                   
          , ('DK', N'Дания', N'Копенгаген', 55.675614, 12.552697)
          , ('DK', N'Дания', N'Ольборг   ', 57.056757, 9.894005 )

          , ('SE', N'Швеция', N'Стокгольм', 59.338428, 18.051912)
          , ('SE', N'Швеция', N'Гетеборг ', 57.733103, 11.943514)
          , ('SE', N'Швеция', N'Йенчепинг', 57.872203, 14.155923)
                   
          , ('FI', N'Финляндия', N'Хельсинки', 60.193915, 24.918123)
          , ('FI', N'Финляндия', N'Турку    ', 60.465828, 22.215486)
                   
          , ('NO', N'Норвегия', N'Осло      ', 59.932920, 10.708903)
          , ('NO', N'Норвегия', N'Берген    ', 60.384723, 5.332098 )
          , ('NO', N'Норвегия', N'Стравангер', 58.966722, 5.734212 )
                   
          , ('IT', N'Италия', N'Рим      ', 41.895208, 12.442955)
          , ('IT', N'Италия', N'Флоренция', 43.795964, 11.190513)
          , ('IT', N'Италия', N'Милан    ', 45.468880, 9.125083 )
          , ('IT', N'Италия', N'Венеция  ', 45.438475, 12.322449)
          , ('IT', N'Италия', N'Палермо  ', 38.112222, 13.355383)
          , ('IT', N'Италия', N'Генуя    ', 44.425465, 8.930420 )
          , ('IT', N'Италия', N'Неаполь  ', 40.850719, 14.264282)
          , ('IT', N'Италия', N'Болонья  ', 44.499955, 11.336426)
          , ('IT', N'Италия', N'Турин    ', 45.080815, 7.656006 )
          , ('IT', N'Италия', N'Падуя    ', 45.409559, 11.863769)
          , ('IT', N'Италия', N'Бари     ', 41.124389, 16.862549)
          , ('IT', N'Италия', N'Верона   ', 45.444256, 10.979370)
          , ('IT', N'Италия', N'Лечче    ', 40.350561, 18.166181)
          , ('IT', N'Италия', N'Сорренто ', 40.654720, 14.383185)
                   
          , ('GR', N'Греция', N'Афины   ', 37.980574, 23.698418)
          , ('GR', N'Греция', N'Салоники', 40.665637, 22.929375)
                   
          , ('SK', N'Словакия', N'Кошице    ', 48.734091, 21.251214)
          , ('SK', N'Словакия', N'Братислава', 48.151059, 17.098382)
                   
          , ('SI', N'Словения', N'Любляна', 46.057601, 14.500115)
          , ('SI', N'Словения', N'Марибор', 46.560523, 15.656177)
                                
          , ('HR', N'Хорватия', N'Загреб   ', 45.810481, 15.985473)
          , ('HR', N'Хорватия', N'Дубровник', 42.659071, 18.078369)
          , ('HR', N'Хорватия', N'Сплит    ', 43.513562, 16.435913)
          , ('HR', N'Хорватия', N'Задар    ', 44.127876, 15.221924)
                   
          , ('ME', N'Черногория', N'Подгорица', 42.447562, 19.247324)
                   
          , ('RO', N'Румыния', N'Бухарест ', 44.449745, 26.100046)
          , ('RO', N'Румыния', N'Клуж     ', 46.785282, 23.562204)
          , ('RO', N'Румыния', N'Констанца', 44.158842, 28.593943)
                   
          , ('BG', N'Болгария', N'София         ', 42.706945, 23.309519)
          , ('BG', N'Болгария', N'Варна         ', 43.229478, 27.879831)
          , ('BG', N'Болгария', N'Пловдив       ', 42.122961, 24.715769)
          , ('BG', N'Болгария', N'Велико-Тырново', 43.077197, 25.594675)
  ) as s(ShortCountryName, Country, City, Latitude, Longitude)
;      
go

insert into #locationInfo
select rtrim(ltrim(s.City)) as City
     , rtrim(ltrim(s.District)) as District
     , rtrim(ltrim(s.Country)) as County
     , 'UA' as ShortCountryName
     , s.Latitude as Latitude
     , s.Longitude as Longitude
  from
  (
    values (N'Украина',N'Автономная Республика Крым',N'Алупка',44.4197222,34.0430556)
         , (N'Украина',N'Автономная Республика Крым',N'Алушта',44.6637211,34.405013)
         , (N'Украина',N'Автономная Республика Крым',N'Армянск',46.1072222,33.6933333)
         , (N'Украина',N'Автономная Республика Крым',N'Бахчисарай',44.7527778,33.8608333)
         , (N'Украина',N'Автономная Республика Крым',N'Белогорск',45.0544444,34.6022222)
         , (N'Украина',N'Автономная Республика Крым',N'Джанкой',45.7086111,34.3933333)
         , (N'Украина',N'Автономная Республика Крым',N'Евпатория',45.2036111,33.3613889)
         , (N'Украина',N'Автономная Республика Крым',N'Керчь',45.33786,36.458401)
         , (N'Украина',N'Автономная Республика Крым',N'Красноперекопск',45.962849,33.787121)
         , (N'Украина',N'Автономная Республика Крым',N'Саки',45.1336111,33.5772222)
         , (N'Украина',N'Автономная Республика Крым',N'Севастополь',44.60000001,33.533333343333)
         , (N'Украина',N'Автономная Республика Крым',N'Симферополь',44.9480556,34.1041667)
         , (N'Украина',N'Автономная Республика Крым',N'Старый Крым',45.0291667,35.0886111)
         , (N'Украина',N'Автономная Республика Крым',N'Судак',44.858799,34.974979)
         , (N'Украина',N'Автономная Республика Крым',N'Феодосия',45.0488889,35.3791667)
         , (N'Украина',N'Автономная Республика Крым',N'Щёлкино',45.4281023,35.8165187)
         , (N'Украина',N'Автономная Республика Крым',N'Ялта',44.4994444,34.1552778)
         , (N'Украина',N'Винницкая область',N'Бар',49.630283,27.001648)
         , (N'Украина',N'Винницкая область',N'Бершадь',48.368954,29.5331654)
         , (N'Украина',N'Винницкая область',N'Винница',49.2333333,28.4833333)
         , (N'Украина',N'Винницкая область',N'Гайсин',48.8094444,29.3905556)
         , (N'Украина',N'Винницкая область',N'Жмеринка',49.038349,28.10556)
         , (N'Украина',N'Винницкая область',N'Казатин',49.711769,28.842859)
         , (N'Украина',N'Винницкая область',N'Калиновка',49.4472222,28.5230556)
         , (N'Украина',N'Винницкая область',N'Ладыжин',48.676151,29.262541)
         , (N'Украина',N'Винницкая область',N'Могилёв-Подольский',48.45,27.8)
         , (N'Украина',N'Винницкая область',N'Немиров',48.9726621,28.835666)
         , (N'Украина',N'Винницкая область',N'Погребище',49.4833333,29.2666667)
         , (N'Украина',N'Винницкая область',N'Тульчин',48.68,28.87)
         , (N'Украина',N'Винницкая область',N'Хмельник',49.563469,27.959379)
         , (N'Украина',N'Винницкая область',N'Шаргород',48.73761,28.08688)
         , (N'Украина',N'Винницкая область',N'Ямполь',49.9572775,26.2290711)
         , (N'Украина',N'Волынская область',N'Берестечко',50.3505636,25.1007738)
         , (N'Украина',N'Волынская область',N'Владимир-Волынский',50.853578,24.311783)
         , (N'Украина',N'Волынская область',N'Горохов',50.500622,24.767559)
         , (N'Украина',N'Волынская область',N'Камень-Каширский',51.6241667,24.9605556)
         , (N'Украина',N'Волынская область',N'Киверцы',50.833621,25.460706)
         , (N'Украина',N'Волынская область',N'Ковель',51.212898,24.71343)
         , (N'Украина',N'Волынская область',N'Луцк',50.75,25.3358333)
         , (N'Украина',N'Волынская область',N'Любомль',51.2230556,24.0377778)
         , (N'Украина',N'Волынская область',N'Нововолынск',50.7333333,24.1666667)
         , (N'Украина',N'Волынская область',N'Рожище',50.915901,25.268551)
         , (N'Украина',N'Волынская область',N'Устилуг',50.86,24.15)
         , (N'Украина',N'Днепропетровская область',N'Апостолово',47.65815,33.697819)
         , (N'Украина',N'Днепропетровская область',N'Верхнеднепровск',48.6561111,34.3283333)
         , (N'Украина',N'Днепропетровская область',N'Вольногорск',48.4833333,34.0166667)
         , (N'Украина',N'Днепропетровская область',N'Днепродзержинск',48.5166667,34.6166667)
         , (N'Украина',N'Днепропетровская область',N'Днепропетровск',48.45,34.9833333)
         , (N'Украина',N'Днепропетровская область',N'Жёлтые Воды',48.35,33.5)
         , (N'Украина',N'Днепропетровская область',N'Кривой Рог',47.899726,33.379534)
         , (N'Украина',N'Днепропетровская область',N'Марганец',47.6397222,34.6363889)
         , (N'Украина',N'Днепропетровская область',N'Никополь',47.5666667,34.4)
         , (N'Украина',N'Днепропетровская область',N'Новомосковск',48.6333333,35.2166667)
         , (N'Украина',N'Днепропетровская область',N'Орджоникидзе',44.9643961,35.3569007)
         , (N'Украина',N'Днепропетровская область',N'Павлоград',48.533939,35.869282)
         , (N'Украина',N'Днепропетровская область',N'Перещепино',49.016251,35.371681)
         , (N'Украина',N'Днепропетровская область',N'Першотравенск',48.3463889,36.4044444)
         , (N'Украина',N'Днепропетровская область',N'Подгородное',49.5355598,25.5276081)
         , (N'Украина',N'Днепропетровская область',N'Пятихатки',48.4113889,33.7105556)
         , (N'Украина',N'Днепропетровская область',N'Синельниково',48.3177778,35.5119444)
         , (N'Украина',N'Днепропетровская область',N'Терновка',48.5402778,29.9677778)
         , (N'Украина',N'Донецкая область',N'Авдеевка',48.1333333,37.7333333)
         , (N'Украина',N'Донецкая область',N'Артёмовск',48.599072,37.999241)
         , (N'Украина',N'Донецкая область',N'Волноваха',47.596119,37.490429)
         , (N'Украина',N'Донецкая область',N'Горловка',48.346432,38.059513)
         , (N'Украина',N'Донецкая область',N'Дзержинск',48.4,37.8333333)
         , (N'Украина',N'Донецкая область',N'Дебальцево',48.3333333,38.4)
         , (N'Украина',N'Донецкая область',N'Димитров',48.32357,37.291854)
         , (N'Украина',N'Донецкая область',N'Доброполье',48.4691324,37.0871223)
         , (N'Украина',N'Донецкая область',N'Докучаевск',47.770821,37.684361)
         , (N'Украина',N'Донецкая область',N'Донецк',48.0027778,37.8052778)
         , (N'Украина',N'Донецкая область',N'Дружковка',48.6166667,37.5333333)
         , (N'Украина',N'Донецкая область',N'Енакиево',48.2166667,38.2)
         , (N'Украина',N'Донецкая область',N'Ждановка',48.1462985,38.2540176)
         , (N'Украина',N'Донецкая область',N'Зугрэс',48.0166667,38.2666667)
         , (N'Украина',N'Донецкая область',N'Кировское',48.15,38.3666667)
         , (N'Украина',N'Донецкая область',N'Краматорск',48.736462,37.57164)
         , (N'Украина',N'Донецкая область',N'Красноармейск',48.2827778,37.1827778)
         , (N'Украина',N'Донецкая область',N'Красный Лиман',48.984211,37.810329)
         , (N'Украина',N'Донецкая область',N'Константиновка',48.51545,37.703629)
         , (N'Украина',N'Донецкая область',N'Мариуполь',47.1166667,37.55)
         , (N'Украина',N'Донецкая область',N'Макеевка',48.076179,38.068427)
         , (N'Украина',N'Донецкая область',N'Новогродовка',48.2045408,37.336821)
         , (N'Украина',N'Донецкая область',N'Селидово',48.144671,37.297897)
         , (N'Украина',N'Донецкая область',N'Славянск',48.846851,37.57954)
         , (N'Украина',N'Донецкая область',N'Снежное',48.0282789,38.7656122)
         , (N'Украина',N'Донецкая область',N'Соледар',48.6833333,38.1)
         , (N'Украина',N'Донецкая область',N'Торез',48.0166667,38.6333333)
         , (N'Украина',N'Донецкая область',N'Угледар',47.7833333,37.25)
         , (N'Украина',N'Донецкая область',N'Харцызск',48.037411,38.160301)
         , (N'Украина',N'Донецкая область',N'Шахтёрск',48.0333333,38.4833333)
         , (N'Украина',N'Донецкая область',N'Ясиноватая',48.1221425,37.8765944)
         , (N'Украина',N'Житомирская область',N'Андрушёвка',50.0166667,29.0166667)
         , (N'Украина',N'Житомирская область',N'Барановка',50.30204,27.67634)
         , (N'Украина',N'Житомирская область',N'Бердичев',49.903381,28.599251)
         , (N'Украина',N'Житомирская область',N'Житомир',50.259749,28.676248)
         , (N'Украина',N'Житомирская область',N'Коростень',50.95,28.6333333)
         , (N'Украина',N'Житомирская область',N'Коростышев',50.316639,29.06653)
         , (N'Украина',N'Житомирская область',N'Малин',50.77121,29.25297)
         , (N'Украина',N'Житомирская область',N'Новоград-Волынский',50.59256,27.62348)
         , (N'Украина',N'Житомирская область',N'Овруч',51.327251,28.818979)
         , (N'Украина',N'Житомирская область',N'Радомышль',50.4947222,29.2333333)
         , (N'Украина',N'Закарпатская область',N'Берегово',48.2,22.6333333)
         , (N'Украина',N'Закарпатская область',N'Виноградов',48.138142,23.041519)
         , (N'Украина',N'Закарпатская область',N'Иршава',48.310911,23.037711)
         , (N'Украина',N'Закарпатская область',N'Мукачево',48.442411,22.723352)
         , (N'Украина',N'Закарпатская область',N'Перечин',48.7341667,22.4741667)
         , (N'Украина',N'Закарпатская область',N'Рахов',48.060829,24.205059)
         , (N'Украина',N'Закарпатская область',N'Свалява',48.5472222,22.9861111)
         , (N'Украина',N'Закарпатская область',N'Тячев',48.0113889,23.5722222)
         , (N'Украина',N'Закарпатская область',N'Ужгород',48.6166667,22.3)
         , (N'Украина',N'Закарпатская область',N'Хуст',48.1813889,23.2977778)
         , (N'Украина',N'Закарпатская область',N'Чоп',48.4333333,22.2)
         , (N'Украина',N'Запорожская область',N'Бердянск',46.748581,36.809502)
         , (N'Украина',N'Запорожская область',N'Васильевка',47.433708,35.27816)
         , (N'Украина',N'Запорожская область',N'Вольнянск',47.9419444,35.4280556)
         , (N'Украина',N'Запорожская область',N'Гуляйполе',47.658562,36.252918)
         , (N'Украина',N'Запорожская область',N'Днепрорудное',47.3840983,34.98121)
         , (N'Украина',N'Запорожская область',N'Запорожье',47.853748,35.157139)
         , (N'Украина',N'Запорожская область',N'Каменка-Днепровская',47.488911,34.400761)
         , (N'Украина',N'Запорожская область',N'Мелитополь',46.847839,35.364979)
         , (N'Украина',N'Запорожская область',N'Молочанск',47.206982,35.59618)
         , (N'Украина',N'Запорожская область',N'Орехов',47.5666667,35.7833333)
         , (N'Украина',N'Запорожская область',N'Пологи',47.47728,36.25626)
         , (N'Украина',N'Запорожская область',N'Приморск',46.7333333,36.35)
         , (N'Украина',N'Запорожская область',N'Токмак',47.25,35.7)
         , (N'Украина',N'Запорожская область',N'Энергодар',47.4979877,34.6565334)
         , (N'Украина',N'Ивано-Франковская область',N'Болехов',49.070011,23.864719)
         , (N'Украина',N'Ивано-Франковская область',N'Бурштын',49.263802,24.634211)
         , (N'Украина',N'Ивано-Франковская область',N'Галич',49.1247222,24.7286111)
         , (N'Украина',N'Ивано-Франковская область',N'Городенка',48.6675,25.5002778)
         , (N'Украина',N'Ивано-Франковская область',N'Долина',51.79,33.76)
         , (N'Украина',N'Ивано-Франковская область',N'Ивано-Франковск',48.9166667,24.7166667)
         , (N'Украина',N'Ивано-Франковская область',N'Калуш',49.050465,24.374117)
         , (N'Украина',N'Ивано-Франковская область',N'Коломыя',48.53146,25.039709)
         , (N'Украина',N'Ивано-Франковская область',N'Косов',48.315,25.0952778)
         , (N'Украина',N'Ивано-Франковская область',N'Надворная',48.6333333,24.5833333)
         , (N'Украина',N'Ивано-Франковская область',N'Рогатин',49.411449,24.62051)
         , (N'Украина',N'Ивано-Франковская область',N'Снятын',48.45,25.5666667)
         , (N'Украина',N'Ивано-Франковская область',N'Тысменица',48.9008333,24.8491667)
         , (N'Украина',N'Ивано-Франковская область',N'Тлумач',48.8666667,25.0)
         , (N'Украина',N'Ивано-Франковская область',N'Яремче',48.449523,24.557508)
         , (N'Украина',N'Киевская область',N'Белая Церковь',49.7988889,30.1152778)
         , (N'Украина',N'Киевская область',N'Березань',50.3197222,31.47)
         , (N'Украина',N'Киевская область',N'Богуслав',49.541031,30.88073)
         , (N'Украина',N'Киевская область',N'Борисполь',50.350491,30.960739)
         , (N'Украина',N'Киевская область',N'Боярка',49.323518,30.700165)
         , (N'Украина',N'Киевская область',N'Бровары',50.5166667,30.8166667)
         , (N'Украина',N'Киевская область',N'Буча',50.5569165,30.2230733)
         , (N'Украина',N'Киевская область',N'Васильков',50.178959,30.32715)
         , (N'Украина',N'Киевская область',N'Вишнёвое',50.4377778,33.3822222)
         , (N'Украина',N'Киевская область',N'Вышгород',50.5833333,30.5)
         , (N'Украина',N'Киевская область',N'Ирпень',50.5166667,30.25)
         , (N'Украина',N'Киевская область',N'Кагарлык',49.85722,30.82032)
         , (N'Украина',N'Киевская область',N'Киев',50.584981,30.235748)
         , (N'Украина',N'Киевская область',N'Мироновка',49.661022,30.98458)
         , (N'Украина',N'Киевская область',N'Обухов',50.105728,30.630699)
         , (N'Украина',N'Киевская область',N'Переяслав-Хмельницкий',50.070141,31.45775)
         , (N'Украина',N'Киевская область',N'Припять',51.4977778,24.1180556)
         , (N'Украина',N'Киевская область',N'Ржищев',49.972801,31.04777)
         , (N'Украина',N'Киевская область',N'Сквира',49.73719,29.66901)
         , (N'Украина',N'Киевская область',N'Славутич',51.523777,30.768559)
         , (N'Украина',N'Киевская область',N'Тараща',49.56065,30.510309)
         , (N'Украина',N'Киевская область',N'Тетиев',49.370575,29.680221)
         , (N'Украина',N'Киевская область',N'Узин',49.820228,30.438929)
         , (N'Украина',N'Киевская область',N'Украинка',50.1530861,30.7434917)
         , (N'Украина',N'Киевская область',N'Фастов',50.0833333,29.9166667)
         , (N'Украина',N'Киевская область',N'Чернобыль',51.2666667,30.2166667)
         , (N'Украина',N'Киевская область',N'Яготин',50.244949,31.796261)
         , (N'Украина',N'Кировоградская область',N'Александрия',48.6666667,33.1166667)
         , (N'Украина',N'Кировоградская область',N'Бобринец',48.050861,32.16589)
         , (N'Украина',N'Кировоградская область',N'Гайворон',48.3333333,29.8666667)
         , (N'Украина',N'Кировоградская область',N'Долинская',48.1108333,32.7647222)
         , (N'Украина',N'Кировоградская область',N'Знаменка',48.7166667,32.6666667)
         , (N'Украина',N'Кировоградская область',N'Кировоград',48.508389,32.264801)
         , (N'Украина',N'Кировоградская область',N'Малая Виска',48.65,31.6333333)
         , (N'Украина',N'Кировоградская область',N'Новомиргород',48.7833333,31.65)
         , (N'Украина',N'Кировоградская область',N'Новоукраинка',48.3155556,31.5269444)
         , (N'Украина',N'Кировоградская область',N'Светловодск',49.0502778,33.2419444)
         , (N'Украина',N'Луганская область',N'Александровск',48.5861652,39.1949396)
         , (N'Украина',N'Луганская область',N'Алмазная',48.5166667,38.5833333)
         , (N'Украина',N'Луганская область',N'Алчевск',48.4666667,38.8)
         , (N'Украина',N'Луганская область',N'Антрацит',48.1166667,39.0833333)
         , (N'Украина',N'Луганская область',N'Брянка',48.5133333,38.6430556)
         , (N'Украина',N'Луганская область',N'Вахрушево',48.174579,38.837224)
         , (N'Украина',N'Луганская область',N'Горное',49.1805556,23.7341667)
         , (N'Украина',N'Луганская область',N'Зимогорье',48.5833333,38.9333333)
         , (N'Украина',N'Луганская область',N'Золотое',48.6928568,38.5146349)
         , (N'Украина',N'Луганская область',N'Зоринск',48.4131636,38.6204799)
         , (N'Украина',N'Луганская область',N'Краснодон',48.29607,39.745239)
         , (N'Украина',N'Луганская область',N'Красный Луч',48.134041,38.931419)
         , (N'Украина',N'Луганская область',N'Лисичанск',48.896895,38.444143)
         , (N'Украина',N'Луганская область',N'Луганск',48.573269,39.355659)
         , (N'Украина',N'Луганская область',N'Лутугино',48.4019444,39.2102778)
         , (N'Украина',N'Луганская область',N'Миусинск',48.07,38.9)
         , (N'Украина',N'Луганская область',N'Молодогвардейск',48.3444444,39.6583333)
         , (N'Украина',N'Луганская область',N'Новодружеск',48.9666667,38.35)
         , (N'Украина',N'Луганская область',N'Новопсков',49.544731,39.103889)
         , (N'Украина',N'Луганская область',N'Первомайск',48.05,30.85)
         , (N'Украина',N'Луганская область',N'Перевальск',48.4388889,38.8194444)
         , (N'Украина',N'Луганская область',N'Петровское',48.293331,38.888614)
         , (N'Украина',N'Луганская область',N'Попасная',48.6333333,38.38)
         , (N'Украина',N'Луганская область',N'Приволье',49.016706,38.302668)
         , (N'Украина',N'Луганская область',N'Ровеньки',48.0833333,39.3666667)
         , (N'Украина',N'Луганская область',N'Рубежное',49.0166667,38.3666667)
         , (N'Украина',N'Луганская область',N'Сватово',49.41011,38.15258)
         , (N'Украина',N'Луганская область',N'Свердловск',48.084549,39.65163)
         , (N'Украина',N'Луганская область',N'Северодонецк',48.950191,38.497631)
         , (N'Украина',N'Луганская область',N'Старобельск',49.2666667,38.9166667)
         , (N'Украина',N'Луганская область',N'Стаханов',48.5666667,38.65)
         , (N'Украина',N'Луганская область',N'Суходольск',48.3523068,39.7239205)
         , (N'Украина',N'Луганская область',N'Счастье',48.737247,39.2311974)
         , (N'Украина',N'Луганская область',N'Теплогорск',48.600487,38.5920825)
         , (N'Украина',N'Луганская область',N'Червонопартизанск',48.095566,39.759607)
         , (N'Украина',N'Львовская область',N'Белз',50.380501,24.01269)
         , (N'Украина',N'Львовская область',N'Бобрка',49.6331904,24.2907476)
         , (N'Украина',N'Львовская область',N'Борислав',49.28476,23.42137)
         , (N'Украина',N'Львовская область',N'Броды',50.0833333,25.15)
         , (N'Украина',N'Львовская область',N'Буск',49.9666667,24.6333333)
         , (N'Украина',N'Львовская область',N'Великие Мосты',50.24,24.1394444)
         , (N'Украина',N'Львовская область',N'Глиняны',49.8233333,24.5166667)
         , (N'Украина',N'Львовская область',N'Городок',49.1666667,26.5666667)
         , (N'Украина',N'Львовская область',N'Добромиль',49.5666667,22.7833333)
         , (N'Украина',N'Львовская область',N'Дрогобыч',49.34853,23.51647)
         , (N'Украина',N'Львовская область',N'Дубляны',49.8833333,24.0833333)
         , (N'Украина',N'Львовская область',N'Жидачов',49.3813889,24.1408333)
         , (N'Украина',N'Львовская область',N'Жолква',50.0666667,23.9666667)
         , (N'Украина',N'Львовская область',N'Золочев',49.8083333,24.9011111)
         , (N'Украина',N'Львовская область',N'Каменка-Бугская',50.1,24.35)
         , (N'Украина',N'Львовская область',N'Львов',49.85,24.0166667)
         , (N'Украина',N'Львовская область',N'Мостиска',49.7941667,23.1525)
         , (N'Украина',N'Львовская область',N'Перемышляны',49.67,24.5594444)
         , (N'Украина',N'Львовская область',N'Пустомыты',49.7138889,23.9108333)
         , (N'Украина',N'Львовская область',N'Рава-Русская',50.230431,23.628309)
         , (N'Украина',N'Львовская область',N'Радехов',50.2827778,24.6375)
         , (N'Украина',N'Львовская область',N'Рудки',49.6530556,23.4880556)
         , (N'Украина',N'Львовская область',N'Самбор',49.5166667,23.2027778)
         , (N'Украина',N'Львовская область',N'Сколе',49.036049,23.51232)
         , (N'Украина',N'Львовская область',N'Сокаль',50.4833333,24.2833333)
         , (N'Украина',N'Львовская область',N'Старый Самбор',49.4430556,23.0033333)
         , (N'Украина',N'Львовская область',N'Стрый',49.256171,23.850306)
         , (N'Украина',N'Львовская область',N'Трускавец',49.2805556,23.505)
         , (N'Украина',N'Львовская область',N'Угнев',50.3666667,23.7444444)
         , (N'Украина',N'Львовская область',N'Хыров',49.5333333,22.85)
         , (N'Украина',N'Львовская область',N'Червоноград',50.3833333,24.2333333)
         , (N'Украина',N'Львовская область',N'Яворов',49.942501,23.390989)
         , (N'Украина',N'Николаевская область',N'Баштанка',47.404331,32.445301)
         , (N'Украина',N'Николаевская область',N'Вознесенск',47.587711,31.336)
         , (N'Украина',N'Николаевская область',N'Николаев',46.9666667,32.0)
         , (N'Украина',N'Николаевская область',N'Новая Одесса',47.3166667,31.7833333)
         , (N'Украина',N'Николаевская область',N'Новый Буг',47.6833333,32.5)
         , (N'Украина',N'Николаевская область',N'Очаков',46.6166667,31.55)
         , (N'Украина',N'Николаевская область',N'Первомайск',48.05,30.85)
         , (N'Украина',N'Николаевская область',N'Снигирёвка',47.0666667,32.8166667)
         , (N'Украина',N'Николаевская область',N'Южноукраинск',47.8166667,31.1833333)
         , (N'Украина',N'Одесская область',N'Ананьев',47.7173,29.975639)
         , (N'Украина',N'Одесская область',N'Арциз',45.99739,29.431288)
         , (N'Украина',N'Одесская область',N'Балта',47.9333333,29.6166667)
         , (N'Украина',N'Одесская область',N'Белгород-Днестровский',46.1833333,30.3333333)
         , (N'Украина',N'Одесская область',N'Болград',45.682701,28.61935)
         , (N'Украина',N'Одесская область',N'Измаил',45.3516667,28.8363889)
         , (N'Украина',N'Одесская область',N'Ильичёвск',46.3020534,30.6517391)
         , (N'Украина',N'Одесская область',N'Килия',45.45578,29.273291)
         , (N'Украина',N'Одесская область',N'Кодыма',48.093941,29.13368)
         , (N'Украина',N'Одесская область',N'Котовск',47.75,29.5333333)
         , (N'Украина',N'Одесская область',N'Одесса',46.4666667,30.7333333)
         , (N'Украина',N'Одесская область',N'Татарбунары',45.841418,29.62284)
         , (N'Украина',N'Одесская область',N'Теплодар',46.5,30.3333333)
         , (N'Украина',N'Одесская область',N'Южное',47.8173262,33.5737487)
         , (N'Украина',N'Полтавская область',N'Гадяч',50.3666667,34.0)
         , (N'Украина',N'Полтавская область',N'Глобино',49.3833333,33.2833333)
         , (N'Украина',N'Полтавская область',N'Гребёнка',50.116852,32.44059)
         , (N'Украина',N'Полтавская область',N'Зеньков',50.20955,34.362345)
         , (N'Украина',N'Полтавская область',N'Карловка',49.45,35.1333333)
         , (N'Украина',N'Полтавская область',N'Кременчуг',49.073521,33.4231)
         , (N'Украина',N'Полтавская область',N'Кобеляки',49.145439,34.213638)
         , (N'Украина',N'Полтавская область',N'Комсомольск',49.013756,33.643381)
         , (N'Украина',N'Полтавская область',N'Лохвица',50.36319,33.253288)
         , (N'Украина',N'Полтавская область',N'Лубны',50.0166667,33.0)
         , (N'Украина',N'Полтавская область',N'Миргород',49.963799,33.61869)
         , (N'Украина',N'Полтавская область',N'Пирятин',50.23975,32.514309)
         , (N'Украина',N'Полтавская область',N'Полтава',49.59269,34.551159)
         , (N'Украина',N'Полтавская область',N'Хорол',49.790279,33.207809)
         , (N'Украина',N'Полтавская область',N'Червонозаводское',50.4,33.4)
         , (N'Украина',N'Ровенская область',N'Березне',51.0,26.75)
         , (N'Украина',N'Ровенская область',N'Дубно',50.38738,25.754559)
         , (N'Украина',N'Ровенская область',N'Дубровица',51.571209,26.56805)
         , (N'Украина',N'Ровенская область',N'Здолбунов',50.5166667,26.25)
         , (N'Украина',N'Ровенская область',N'Корец',50.619129,27.161869)
         , (N'Украина',N'Ровенская область',N'Костополь',50.8833333,26.45)
         , (N'Украина',N'Ровенская область',N'Кузнецовск',51.3436553,25.8490867)
         , (N'Украина',N'Ровенская область',N'Острог',50.3333333,26.5166667)
         , (N'Украина',N'Ровенская область',N'Радивилов',50.125777,25.264195)
         , (N'Украина',N'Ровенская область',N'Ровно',50.6166667,26.25)
         , (N'Украина',N'Ровенская область',N'Сарны',51.3372222,26.6058333)
         , (N'Украина',N'Сумская область',N'Ахтырка',50.29855,34.892052)
         , (N'Украина',N'Сумская область',N'Белополье',51.149402,34.3175225)
         , (N'Украина',N'Сумская область',N'Бурынь',51.1978,33.847351)
         , (N'Украина',N'Сумская область',N'Глухов',51.6786111,33.9113889)
         , (N'Украина',N'Сумская область',N'Кролевец',51.550121,33.38279)
         , (N'Украина',N'Сумская область',N'Конотоп',51.237469,33.21217)
         , (N'Украина',N'Сумская область',N'Лебедин',48.96,31.52)
         , (N'Украина',N'Сумская область',N'Путивль',51.337589,33.87888)
         , (N'Украина',N'Сумская область',N'Ромны',50.743919,33.475712)
         , (N'Украина',N'Сумская область',N'Середина-Буда',52.1833333,34.0333333)
         , (N'Украина',N'Сумская область',N'Сумы',50.910561,34.80566)
         , (N'Украина',N'Сумская область',N'Тростянец',50.9599282,25.55378)
         , (N'Украина',N'Сумская область',N'Шостка',51.86282,33.487831)
         , (N'Украина',N'Тернопольская область',N'Бережаны',49.444191,24.94486)
         , (N'Украина',N'Тернопольская область',N'Борщёв',48.803181,26.041809)
         , (N'Украина',N'Тернопольская область',N'Бучач',49.05772,25.401979)
         , (N'Украина',N'Тернопольская область',N'Залещики',48.65,25.7333333)
         , (N'Украина',N'Тернопольская область',N'Збараж',49.6666667,25.7777778)
         , (N'Украина',N'Тернопольская область',N'Зборов',49.660696,25.1434667)
         , (N'Украина',N'Тернопольская область',N'Кременец',50.099129,25.7328)
         , (N'Украина',N'Тернопольская область',N'Лановцы',49.8659402,26.0841931)
         , (N'Украина',N'Тернопольская область',N'Монастыриска',49.0888889,25.1694444)
         , (N'Украина',N'Тернопольская область',N'Подволочиск',49.5246859,26.137326)
         , (N'Украина',N'Тернопольская область',N'Подгайцы',49.2694444,25.1361111)
         , (N'Украина',N'Тернопольская область',N'Почаев',50.0,25.5083333)
         , (N'Украина',N'Тернопольская область',N'Скалат',49.424214,25.976246)
         , (N'Украина',N'Тернопольская область',N'Тернополь',49.551361,25.603979)
         , (N'Украина',N'Тернопольская область',N'Теребовля',49.29348,25.699551)
         , (N'Украина',N'Тернопольская область',N'Чортков',49.0166667,25.8)
         , (N'Украина',N'Тернопольская область',N'Шумск',50.122577,26.1149716)
         , (N'Украина',N'Харьковская область',N'Балаклея',49.4658333,36.8677778)
         , (N'Украина',N'Харьковская область',N'Барвенково',48.9,37.0166667)
         , (N'Украина',N'Харьковская область',N'Богодухов',50.1654302,35.5267251)
         , (N'Украина',N'Харьковская область',N'Валки',49.843601,35.61388)
         , (N'Украина',N'Харьковская область',N'Великий Бурлук',50.0455556,37.3905556)
         , (N'Украина',N'Харьковская область',N'Волчанск',50.278519,36.945171)
         , (N'Украина',N'Харьковская область',N'Дергачи',50.110668,36.114361)
         , (N'Украина',N'Харьковская область',N'Змиев',49.701939,36.355171)
         , (N'Украина',N'Харьковская область',N'Изюм',49.2127778,37.2569444)
         , (N'Украина',N'Харьковская область',N'Красноград',49.3666667,35.45)
         , (N'Украина',N'Харьковская область',N'Купянск',49.721901,37.624329)
         , (N'Украина',N'Харьковская область',N'Лозовая',48.891684,36.325786)
         , (N'Украина',N'Харьковская область',N'Люботин',49.95,35.9166667)
         , (N'Украина',N'Харьковская область',N'Мерефа',49.8166667,36.05)
         , (N'Украина',N'Харьковская область',N'Первомайский',49.3833333,36.2166667)
         , (N'Украина',N'Харьковская область',N'Харьков',49.98967,36.208309)
         , (N'Украина',N'Харьковская область',N'Чугуев',49.8355556,36.6863889)
         , (N'Украина',N'Херсонская область',N'Берислав',46.843822,33.4375)
         , (N'Украина',N'Херсонская область',N'Геническ',46.171638,34.80777)
         , (N'Украина',N'Херсонская область',N'Голая Пристань',46.5166667,32.5166667)
         , (N'Украина',N'Херсонская область',N'Каховка',46.817388,33.494325)
         , (N'Украина',N'Херсонская область',N'Новая Каховка',46.7666667,33.3666667)
         , (N'Украина',N'Херсонская область',N'Скадовск',46.116871,32.913731)
         , (N'Украина',N'Херсонская область',N'Таврийск',46.7528018,33.4216856)
         , (N'Украина',N'Херсонская область',N'Херсон',46.653368,32.629424)
         , (N'Украина',N'Херсонская область',N'Цюрупинск',46.62,32.72)
         , (N'Украина',N'Хмельницкая область',N'Волочиск',49.535179,26.22331)
         , (N'Украина',N'Хмельницкая область',N'Городок',49.1666667,26.5666667)
         , (N'Украина',N'Хмельницкая область',N'Деражня',49.267071,27.440269)
         , (N'Украина',N'Хмельницкая область',N'Дунаевцы',48.8909743,26.8546608)
         , (N'Украина',N'Хмельницкая область',N'Изяслав',50.119221,26.82629)
         , (N'Украина',N'Хмельницкая область',N'Каменец-Подольский',48.6833333,26.5833333)
         , (N'Украина',N'Хмельницкая область',N'Красилов',49.6519444,26.9705556)
         , (N'Украина',N'Хмельницкая область',N'Нетешин',50.3374232,26.6404529)
         , (N'Украина',N'Хмельницкая область',N'Полонное',50.122269,27.511909)
         , (N'Украина',N'Хмельницкая область',N'Славута',49.0563905,27.3944506)
         , (N'Украина',N'Хмельницкая область',N'Староконстантинов',49.7555556,27.2208333)
         , (N'Украина',N'Хмельницкая область',N'Хмельницкий',49.4166667,27.0)
         , (N'Украина',N'Хмельницкая область',N'Шепетовка',50.179131,27.07732)
         , (N'Украина',N'Черкасская область',N'Ватутино',49.0166667,31.0666667)
         , (N'Украина',N'Черкасская область',N'Городище',49.290649,31.443199)
         , (N'Украина',N'Черкасская область',N'Жашков',49.245522,30.11998)
         , (N'Украина',N'Черкасская область',N'Звенигородка',49.075489,30.967911)
         , (N'Украина',N'Черкасская область',N'Золотоноша',49.674271,32.040421)
         , (N'Украина',N'Черкасская область',N'Каменка',49.036347,32.103481)
         , (N'Украина',N'Черкасская область',N'Канев',49.75,31.4666667)
         , (N'Украина',N'Черкасская область',N'Корсунь-Шевченковский',49.421051,31.268993)
         , (N'Украина',N'Черкасская область',N'Монастырище',48.9909154,29.8051363)
         , (N'Украина',N'Черкасская область',N'Смела',49.224621,31.878401)
         , (N'Украина',N'Черкасская область',N'Тальное',48.8833333,30.7)
         , (N'Украина',N'Черкасская область',N'Умань',48.75,30.2166667)
         , (N'Украина',N'Черкасская область',N'Христиновка',48.8494444,29.97)
         , (N'Украина',N'Черкасская область',N'Черкассы',49.4333333,32.0666667)
         , (N'Украина',N'Черкасская область',N'Чигирин',49.072498,32.683578)
         , (N'Украина',N'Черкасская область',N'Шпола',49.00349,31.385559)
         , (N'Украина',N'Черниговская область',N'Бахмач',51.1830556,32.8297222)
         , (N'Украина',N'Черниговская область',N'Бобровица',50.745,31.3869444)
         , (N'Украина',N'Черниговская область',N'Борзна',51.249451,32.43034)
         , (N'Украина',N'Черниговская область',N'Городня',51.8905556,31.5936111)
         , (N'Украина',N'Черниговская область',N'Десна',50.9246667,30.756)
         , (N'Украина',N'Черниговская область',N'Ичня',50.863918,32.39307)
         , (N'Украина',N'Черниговская область',N'Корюковка',51.7754831,32.2595792)
         , (N'Украина',N'Черниговская область',N'Мена',51.521759,32.21888)
         , (N'Украина',N'Черниговская область',N'Нежин',51.0380556,31.8861111)
         , (N'Украина',N'Черниговская область',N'Новгород-Северский',52.0069896,33.2537069)
         , (N'Украина',N'Черниговская область',N'Носовка',50.9333333,31.5833333)
         , (N'Украина',N'Черниговская область',N'Прилуки',50.594181,32.38689)
         , (N'Украина',N'Черниговская область',N'Седнев',51.6463023,31.5616846)
         , (N'Украина',N'Черниговская область',N'Семёновка',52.173561,32.587059)
         , (N'Украина',N'Черниговская область',N'Чернигов',51.503653,31.293167)
         , (N'Украина',N'Черниговская область',N'Щорс',51.819321,31.94846)
         , (N'Украина',N'Черновицкая область',N'Вашковцы',48.38,25.51)
         , (N'Украина',N'Черновицкая область',N'Вижница',48.25,25.1916667)
         , (N'Украина',N'Черновицкая область',N'Герца',48.1485764,26.2572996)
         , (N'Украина',N'Черновицкая область',N'Заставна',48.5166667,25.85)
         , (N'Украина',N'Черновицкая область',N'Кицмань',48.4425,25.7613889)
         , (N'Украина',N'Черновицкая область',N'Новоднестровск',48.5833333,27.4333333)
         , (N'Украина',N'Черновицкая область',N'Новоселица',48.2166667,26.2666667)
         , (N'Украина',N'Черновицкая область',N'Сокиряны',48.45,27.4166667)
         , (N'Украина',N'Черновицкая область',N'Сторожинец',48.1666667,25.7166667)
         , (N'Украина',N'Черновицкая область',N'Хотин',48.5,26.5)
         , (N'Украина',N'Черновицкая область',N'Черновцы',48.3,25.9333333)
  ) as s(Country, District, City, Latitude, Longitude)
;      
go


merge into Country trg
using
(
  select distinct Country as Name
                , ShortCountryName as ShortName
    from #locationInfo
) src
on src.Name = trg.Name
  when not matched then
    insert (Name, ShortName)
    values (src.Name, src.ShortName)
;
go

merge into District trg
using
(
  select distinct li.District as Name
                , c.Id as CountryId
    from #locationInfo li
    join Country c on li.Country = c.Name
    where li.District is not null
) src
on src.Name = trg.Name and src.CountryId = trg.CountryId
  when not matched then
    insert (Name, CountryId)
    values (src.Name, src.CountryId)
;
go

merge into City trg
using
(
  select li.City as Name
       , d.Id as DistrictId
    from #locationInfo li
    join District d on d.Name = li.District
    where li.District is not null
) src
on src.Name = trg.Name and src.DistrictId = trg.DistrictId
  when not matched then
    insert (Name, DistrictId)
    values (src.Name, src.DistrictId)
;
go

merge into Location trg
using
(
  select c.Id as CountryId
       , d.Id as DistrictId
       , ci.Id as CityId
       , li.City as Name
       , li.Latitude as Latitude
       , li.Longitude as Longitude
       , crypt_gen_random(1) % 2 as IsParking -- random value 
    from #locationInfo li
    left join Country c 
      on li.Country = c.Name
    left join District d
      on li.District = d.Name and c.Id = d.CountryId
    left join City ci 
      on li.City = ci.Name and d.Id = ci.DistrictId
) src
on src.CountryId = trg.CountryId and src.DistrictId = trg.DistrictId and src.CityId = trg.CityId and src.Name = trg.Name 
  when not matched then
    insert (CountryId, DistrictId, CityId, Name, Latitude, Longitude, IsParking)
    values (src.CountryId, src.DistrictId, src.CityId, src.Name, src.Latitude, src.Longitude, src.IsParking)
;
go

drop table #locationInfo;
go